       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM2.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
            DISPLAY 'PROGRAM1 RAN SUCCESSFULLY'.
            STOP RUN.